Revit 2027 API
WireSet.Clear Method
Removes every item from the set, rendering it empty.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Clear()
Public Overridable Sub Clear
public:
virtual void Clear()
abstract Clear : unit -> unit
override Clear : unit -> unit
See Also
Reference
WireSet Class
Autodesk.Revit.DB.Electrical Namespace